{
    "get_started": "Get started",
    "continue": "Continue",
    "welcome_title": "Control the game by mastering time",
    "about": "About",
    "contact": "Contacts",
    "policy": "Policy",
    "rights": "All rights reserved",
    "about_1": "👀 SpellTimer is a free assistant app for tracking cooldowns of abilities and items in Dota 2.",
    "about_2": "✨ SpellTimer fully adheres to Valve’s fair play guidelines, as it does not access data directly from the Dota 2 client. The app provides an intuitive interface where all actions are performed manually by the player—no more need to type cooldowns into the in-game chat.",
    "about_3": "🚀 The app requires no installation or account creation—it is available directly in your browser.",
    "about_4": "⚡ Currently, SpellTimer includes basic features and minimal conveniences, enough to gauge its usefulness among players. Once its demand is confirmed, the next update will address shortcomings, optimize performance, and enhance the user experience.",
    "about_5": "🎨 The current version of SpellTimer is targeted exclusively at Dota 2 players. However, if demand arises, the app may be expanded to support other games with similar mechanics.",
    "about_6": "📌 SpellTimer is an unofficial project and is not affiliated with Valve Corporation. All mentioned names, logos, and trademarks are the property of their respective owners and are used for informational and non-commercial purposes only.",
    "about_7": "Sound effect provided by ZapSplat.com",
    "contact_1": "We’re always open to feedback and strive to consider players’ suggestions. If you have ideas, questions, or suggestions—don’t hesitate to contact us via email or social media:",
    "contact_2": "My name is Artemiy. I’m the developer and creator of SpellTimer, an interface solution for Dota 2 players. This is a personal initiative into which I’ve poured my experience, attention to detail, and love for the game. I’m open to professional collaboration in web development and startup projects.",
    "contact_3": "For collaboration inquiries, feel free to contact me via email:",
    "author": "Author",
    "support": "Support the project",
    "donation_1": "We sincerely hope that SpellTimer is useful to you — it was created with love and enthusiasm.",
    "donation_2": "Maintaining servers and continuing development takes time and resources. Even the smallest contribution means a lot to us!",
    "donation_3": "If you enjoy the app and would like to support the project, you can do so using the links below. Thank you for your support!",
    "thnx_btn": "I supported the project",
    "thnx_1": "🎉 Thank you for your support!",
    "thnx_2": "🚀 Thanks to you, the project keeps growing and improving!",
    "copied": "Copied",
    "all": "All",
    "spells": "Spells",
    "items": "Artifacts",
    "other": "Other",
    "notification": "Starting or pausing one of the timers automatically applies the same action to all previously activated timers, since cooldown timing in Dota 2 is synchronized across all abilities and items.",
    "notification_checkbox": "Don’t show this notification again",
    "ok": "Ok",
    "sec": "sec",
    "politics_1": "Privacy Policy for the SpellTimer app",
    "politics_2": "Last updated:",
    "politics_3": "Your trust is important to us. This policy explains what data we collect, how we use it, and how we protect it.",
    "politics_4": "1. What data we collect",
    "politics_5": "1.1 Locally on the device",
    "politics_6": "We only store data that you enter manually, such as: assigned hotkeys, interface and timer preferences. This data is stored only in your browser via localStorage. We do not send it to any servers.",
    "politics_7": "1.2 Anonymous statistics via Yandex Metrica",
    "politics_8": "We use Yandex Metrica to collect anonymous usage statistics. This includes: number of visits and sessions, user geography (country/city, based on IP address), device and browser type, visited pages, and technical errors (if any). All of this data does not allow us to identify you personally.",
    "politics_9": "2. Donations",
    "politics_10": "If you choose to support the project with a donation, you will be redirected to third-party payment platforms (such as DonationAlerts, etc.). We do not process or store your payment data — all transactions are handled through the secure systems of the payment services themselves.",
    "politics_11": "3. Third-party services",
    "politics_12": "The app uses only one third-party service: Yandex Metrica — for collecting anonymized analytics.",
    "politics_13": "4. Security",
    "politics_14": "We do not store or transmit personal data. All user settings remain only in your browser. Analytics is completely anonymous and used solely to improve the application's performance.",
    "politics_15": "5. Contact",
    "politics_16": "If you have any questions or suggestions, you can contact us via email: spelltimer@gmail.com",
    "politics_17": "6. Policy updates",
    "politics_18": "We may periodically make changes to this policy. The current version will always be available via the link in the app.",
    "clear_slots": "Clear slots",
    "reset_timers": "Reset timers",
    "start_mode": "Start mode",
    "setup_mode": "Setup mode",
    "time_forward": "Fast-forward time",
    "time_back": "Rewind time",
    "hotkey_start": "Timer start hotkey",
    "hotkey_forward": "Fast-forward hotkey",
    "hotkey_back": "Rewind hotkey",
    "close": "Close",
    "cancel": "Cancel",
    "delete": "Delete",
    "reset_timer": "Reset timer",
    "manual_cd": "Enter cooldown manually",
    "save": "Save",
    "cancel_manual_cd": "Cancel manual cooldown",
    "start": "Start",
    "pause": "Pause",
    "add_tracked_item": "Add tracked ability/item/function",
    "copy": "Copy",
    "show_qr": "Show QR code",
    "press_to_bind": "Press any key to bind it",
    "hotkey_toggle_timer": "Hotkey to start/pause timer",
    "last_update": "Last update: 05.07.2025 (v.1.0.2)",
    "with_sound": "With sound",
    "without_sound": "Without sound"
}