{
    "get_started": "Empezar",
    "continue": "Continuar",
    "welcome_title": "Controla el juego controlando el tiempo",
    "about": "Acerca de la aplicación",
    "contact": "Contacto",
    "policy": "Política",
    "rights": "Todos los derechos reservados",
    "about_1": "👀 SpellTimer es una aplicación gratuita de asistencia para hacer seguimiento de los tiempos de reutilización de habilidades y objetos en Dota 2.",
    "about_2": "✨ SpellTimer cumple completamente con los principios de juego limpio establecidos por Valve, ya que no accede a datos directamente desde el cliente de Dota 2. La aplicación ofrece una interfaz intuitiva donde todas las acciones las realiza el propio jugador—ya no es necesario escribir los tiempos en el chat del juego.",
    "about_3": "🚀 La aplicación no requiere instalación ni creación de cuenta—está disponible directamente en el navegador.",
    "about_4": "⚡ Actualmente, SpellTimer ofrece funciones básicas y comodidad mínima, suficientes para evaluar su utilidad entre los jugadores. Una vez se confirme su demanda, la siguiente actualización solucionará errores, optimizará el rendimiento y mejorará la experiencia del usuario.",
    "about_5": "🎨 La versión actual de SpellTimer está orientada exclusivamente a los jugadores de Dota 2, pero si hay suficiente interés, la aplicación podría expandirse a otros juegos con mecánicas similares.",
    "about_6": "📌 SpellTimer es un proyecto no oficial y no está afiliado a Valve Corporation. Todos los nombres, logotipos y marcas mencionados son propiedad de sus respectivos dueños y se usan solo con fines informativos y no comerciales.",
    "contact_1": "Siempre estamos abiertos a recibir comentarios y procuramos tener en cuenta las sugerencias de los jugadores. Si tienes ideas, preguntas o propuestas, no dudes en contactarnos por correo electrónico o redes sociales:",
    "contact_2": "Mi nombre es Artemiy. Soy el desarrollador y creador de SpellTimer, una solución de interfaz para jugadores de Dota 2. Este proyecto es una iniciativa personal en la que he volcado mi experiencia, atención al detalle y amor por el juego. Estoy abierto a colaborar profesionalmente en desarrollo web y proyectos emergentes.",
    "contact_3": "Para consultas de colaboración, no dudes en contactarme por correo electrónico:",
    "author": "Autor",
    "support": "Apoyar el proyecto",
    "donation_1": "Esperamos sinceramente que SpellTimer te sea útil — fue creado con cariño y entusiasmo.",
    "donation_2": "Mantener los servidores y continuar con el desarrollo requiere tiempo y recursos. ¡Incluso la contribución más pequeña es muy valiosa para nosotros!",
    "donation_3": "Si te gusta la aplicación y deseas apoyar el proyecto, puedes hacerlo a través de los enlaces que encontrarás abajo. ¡Gracias por tu apoyo!",
    "thnx_btn": "Apoyé el proyecto",
    "thnx_1": "🎉 ¡Gracias por tu apoyo!",
    "thnx_2": "🚀 ¡Gracias a ti, el proyecto sigue creciendo y mejorando!",
    "copied": "Copiado",
    "all": "Todos",
    "spells": "Hechizos",
    "items": "Objetos",
    "other": "Otros",
    "notification": "Iniciar o pausar uno de los temporizadores aplica automáticamente la misma acción a todos los temporizadores previamente activados, ya que los tiempos de reutilización en Dota 2 están sincronizados para todas las habilidades y objetos.",
    "notification_checkbox": "No volver a mostrar esta notificación",
    "ok": "Ok",
    "sec": "seg",
    "politics_1": "Política de privacidad de la aplicación SpellTimer",
    "politics_2": "Fecha de actualización:",
    "politics_3": "Tu confianza es importante para nosotros. En esta política explicamos qué datos recopilamos, cómo los usamos y cómo los protegemos.",
    "politics_4": "1. Qué datos recopilamos",
    "politics_5": "1.1 Localmente en el dispositivo",
    "politics_6": "Solo almacenamos los datos que introduces manualmente: teclas rápidas asignadas, preferencias de interfaz y temporizadores. Estos datos se guardan únicamente en tu navegador mediante localStorage. No se envían a ningún servidor.",
    "politics_7": "1.2 Estadísticas anónimas mediante Yandex Metrica",
    "politics_8": "Utilizamos Yandex Metrica para recopilar estadísticas anónimas de uso. Esto incluye: número de visitas, ubicación geográfica (país/ciudad según la IP), tipo de dispositivo y navegador, páginas visitadas y errores técnicos (si los hay). Estos datos no permiten identificarte personalmente.",
    "politics_9": "2. Donaciones",
    "politics_10": "Si decides apoyar el proyecto con una donación, serás redirigido a plataformas de pago externas (como DonationAlerts, etc.). No procesamos ni almacenamos tus datos de pago — todas las transacciones se realizan a través de los sistemas seguros de los servicios de pago.",
    "politics_11": "3. Servicios de terceros",
    "politics_12": "La aplicación utiliza solo un servicio de terceros: Yandex Metrica, para recopilar análisis anónimos.",
    "politics_13": "4. Seguridad",
    "politics_14": "No almacenamos ni transmitimos datos personales. Todos los ajustes del usuario permanecen solo en tu navegador. La analítica es completamente anónima y se utiliza únicamente para mejorar la calidad de la aplicación.",
    "politics_15": "5. Contacto",
    "politics_16": "Si tienes preguntas o sugerencias, puedes escribirnos por correo: spelltimer@gmail.com",
    "politics_17": "6. Actualizaciones de la política",
    "politics_18": "Podemos hacer cambios a esta política periódicamente. La versión actual siempre estará disponible mediante un enlace dentro de la aplicación."
}