import React from 'react';
import Header from '../Header/Header';
import Footer from '../Footer/Footer';
import {makeSnakeCase} from '../../utils/utils';
import './About.scss';


const About = () => {
    return <div className='About' style={{backgroundImage: `url("/assets/other/${makeSnakeCase('settings4')}.png")`}}>
        <Header />
        <div className="AppLayout">
            <div className="AppContent">
                <h2 className='AppTitle'>
                    <span className="AppTitle__icon left">
                        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 21 19" >
                        <path d="M18.3562 0.90625H2.64375C1.37578 0.90625 0.34375 1.9375 0.34375 3.20547V13.45C0.34375 14.7187 1.37578 15.75 2.64375 15.75H3.46875V18.0938C3.46875 18.5258 3.81875 18.875 4.25 18.875C4.68125 18.875 5.03125 18.5258 5.03125 18.0938V17.3125H15.9688V18.0938C15.9688 18.5258 16.3188 18.875 16.75 18.875C17.1812 18.875 17.5312 18.5258 17.5312 18.0938V15.75H18.3562C19.6242 15.75 20.6562 14.7187 20.6562 13.4508V3.20547C20.6562 1.9375 19.6242 0.90625 18.3562 0.90625ZM19.0938 13.4508C19.0938 13.857 18.7633 14.1875 18.3562 14.1875H2.64375C2.23672 14.1875 1.90625 13.857 1.90625 13.4508V3.20547C1.90625 2.79922 2.23672 2.46875 2.64375 2.46875H18.3562C18.7633 2.46875 19.0938 2.79922 19.0938 3.20547V13.4508Z" fill="#6FFF1C"/>
                        <path d="M16.3023 12.7547C17.0617 12.7547 17.6773 12.1391 17.6773 11.3797C17.6773 10.6203 17.0617 10.0047 16.3023 10.0047C15.543 10.0047 14.9273 10.6203 14.9273 11.3797C14.9273 12.1391 15.543 12.7547 16.3023 12.7547Z" fill="#6FFF1C"/>
                        <path d="M17.5312 4.03125H15.1875C14.9719 4.03125 14.7969 4.20625 14.7969 4.42188C14.7969 4.6375 14.9719 4.8125 15.1875 4.8125H17.5312C17.7469 4.8125 17.9219 4.6375 17.9219 4.42188C17.9219 4.20625 17.7469 4.03125 17.5312 4.03125Z" fill="#6FFF1C"/>
                        <path d="M17.5312 5.59375H15.1875C14.9719 5.59375 14.7969 5.76875 14.7969 5.98438C14.7969 6.2 14.9719 6.375 15.1875 6.375H17.5312C17.7469 6.375 17.9219 6.2 17.9219 5.98438C17.9219 5.76875 17.7469 5.59375 17.5312 5.59375Z" fill="#6FFF1C"/>
                        <path d="M17.5312 7.15625H15.1875C14.9719 7.15625 14.7969 7.33125 14.7969 7.54688C14.7969 7.7625 14.9719 7.9375 15.1875 7.9375H17.5312C17.7469 7.9375 17.9219 7.7625 17.9219 7.54688C17.9219 7.33125 17.7469 7.15625 17.5312 7.15625Z" fill="#6FFF1C"/>
                        <path d="M12.4195 4.03125H4.67422C4.00938 4.03125 3.46875 4.57188 3.46875 5.23672V11.4195C3.46875 12.0844 4.00938 12.625 4.67422 12.625H12.4195C13.0844 12.625 13.625 12.0844 13.625 11.4195V5.23672C13.625 4.57188 13.0844 4.03125 12.4195 4.03125Z" fill="#6FFF1C"/>
                        </svg>
                    </span>
                    О ПРИЛОЖЕНИИ
                </h2>
                <p>SpellTimer — это вспомогательное приложение, разработанное для игроков в Dota 2, стремящихся повысить точность и осознанность своих действий в игре. Оно помогает контролировать перезарядку способностей и предметов противников, минимизируя фактор случайности и улучшая принятие решений во время матчей.</p>
                <p>В отличие от сторонних программ, нарушающих правила честной игры, SpellTimer не получает данные напрямую из клиента Dota 2. Все события фиксируются вручную самими игроками, что полностью соответствует политикам Valve. Приложение выступает в роли интуитивного интерфейса, заменяющего устаревшие методы, такие как фиксация времени в игровом чате.</p>
                <p>SpellTimer не предоставляет преимуществ за пределами внимательности и скорости реакции самого пользователя — он лишь делает процесс отслеживания удобнее, нагляднее и эффективнее.</p>
                <p>На текущий момент SpellTimer ориентирован на Dota 2. Однако в грядущих обновлениях, при наличии интереса со стороны игроков, приложение может быть адаптировано для других игр с подобной механикой.</p>
            </div>
        </div>
        <Footer />
    </div>
}

export default About;